todo_rails_api/app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    @todos = Todo.all

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    begin
      @todo = Todo.find(params[:id])